### [실습1]

#### 1) 라이브러리 로드

In [1]:
import pandas as pd

#### 2) 아래와 같은 데이터프레임 생성

In [6]:
dict1=[
    {
        "홍길동":88,
        "강감찬":82,
        "김종민" : 75,
        "임창정":75
    },
    {
        "홍길동":75,
        "강감찬":62,
        "김종민" : 69,
        "임창정":56
    },
    {
        "홍길동":95,
        "강감찬":85,
        "김종민" : 70,
        "임창정":80
    }
]

df1 = pd.DataFrame(dict1,index=["java","python","basic"])
df1

        홍길동  강감찬  김종민  임창정
java     88   82   75   75
python   75   62   69   56
basic    95   85   70   80

#### 3) 홍길동 학생의 과목별 점수 출력

In [30]:
df1["홍길동"]

java      88
python    75
basic     95
sql       70
Name: 홍길동, dtype: int64

#### 4) 모든 학생들의 python 과목의 점수 출력

In [31]:
df1.loc["python"]

홍길동    75
강감찬    62
김종민    69
임창정    56
Name: python, dtype: int64

#### 5) basic 점수를 삭제

In [11]:
df1.drop("basic")

        홍길동  강감찬  김종민  임창정
java     88   82   75   75
python   75   62   69   56

#### 6) sql 과목의 점수 추가 : [70,85,86,92]

In [14]:
df1.loc["sql"]=[70,85,86,92]
df1

        홍길동  강감찬  김종민  임창정
java     88   82   75   75
python   75   62   69   56
basic    95   85   70   80
sql      70   85   86   92

### [실습2]

#### 1) 아래와 같은 데이터프레임 생성

In [15]:
dict2=[
    {
        "미국":2.1,
        "한국":0.40,
        "중국":10
    },
    {
        "미국":2.2,
        "한국":0.50,
        "중국":13
    },
    {
        "미국":2.3,
        "한국":0.45,
        "중국":15
    }
]
df2=pd.DataFrame(dict2)
#df2=pd.DataFrame({"미국":[2.0,2.1,2.2],"한국":[0.40,0.50,0.45],"중국":[10,13,15]})
df2

    미국    한국  중국
0  2.1  0.40  10
1  2.2  0.50  13
2  2.3  0.45  15

#### 2) 인덱스를 넣어서 아래와 같은 데이터프레임 생성

In [27]:
df2=pd.DataFrame(dict2,index=[2019,2020,2021])
df2

       미국    한국  중국
2019  2.1  0.40  10
2020  2.2  0.50  13
2021  2.3  0.45  15

#### 3) 인덱스 조회

In [18]:
df2.index

Index([2019, 2020, 2021], dtype='int64')

#### 4) 컬럼명 조회

In [19]:
df2.columns

Index(['미국', '한국', '중국'], dtype='object')

#### 5) 전체 값들만 조회

In [32]:
df2.values

array([[ 2.1 ,  0.4 , 10.  ],
       [ 2.2 ,  0.5 , 13.  ],
       [ 2.3 ,  0.45, 15.  ]])

#### 6) 미국 컬럼 조회

In [33]:
df2["미국"]

2019    2.1
2020    2.2
2021    2.3
Name: 미국, dtype: float64

#### 7) 일본 컬럼 추가 : [3,4,5]

In [35]:

df2["일본"]=[3,5,6]
df2

       미국    한국  중국  일본
2019  2.1  0.40  10   3
2020  2.2  0.50  13   5
2021  2.3  0.45  15   6